# DockableFrameVisibilityChangedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockableFrameVisibilityChangedEventArgs Class
Members See Also
---
The event arguments used by the DockableFrameVisibilityChanged event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class DockableFrameVisibilityChangedEventArgs : RevitAPISingleEventArgs
```

Visual Basic
---
```text
Public Class DockableFrameVisibilityChangedEventArgs _
	Inherits RevitAPISingleEventArgs
```

Visual C++
---
```text
public ref class DockableFrameVisibilityChangedEventArgs : public RevitAPISingleEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.UI.Events..::..DockableFrameVisibilityChangedEventArgs
# See Also
DockableFrameVisibilityChangedEventArgs Members
Autodesk.Revit.UI.Events Namespace